

// Використовуючи API Приватбанку потрібно написати додаток, який буде:
// 1) скачувати список банкоматів по заданому користувачем місту - DONE
// 2) зберігати оримані дані в базі даних (CoreData)
// 3) робити пошук серед збережених даних по адресі - DONE
// 4) помічати обранні користувачем банкомати як "улюблені"
// 5) давати можливість швидко переглянути список улуюблених банкоматів 
// 6) давати можливість видалити банкомат зі списку улюблених
// 7) по бажанню користувача показувати:
// а) графік роботи банкомату
// б) розміщення на карті
//
// Операції для яких не потрібен інтернет повинні виконуватися без його наявності. При виконнанні довготривалих  операцій інтерфейс користувача не повинен блокуватися.
//
// Дизайн додатку має бути простий і зрозумілий, обробка виняткових ситуацій (некоректні дані, дані не знайдено,  відсутній інтернет і т.п.). Прогрес бар підчас завантаження даних. При необхідності дозволяється використовувати  сторонні бібліотеки з відкритим кодом.
//
// Додаток повинен бути написаний на Swift не нижче 4 версії. Нам потрібно надати доступ до вихідного коду у     ПРИВАТНОМУ репозиторії (щоб ваш код не був доступний іншим кандидатам). Термін виконання: до 3х днів.
//
// АПІ Приватбанку, Банкомати:
// https://api.privatbank.ua/#p24/atm
